/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   server.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: akihito <akihito@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/01/26 17:26:23 by akihito           #+#    #+#             */
/*   Updated: 2023/01/27 15:27:58 by akihito          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "session.h"

//鬼ごっこゲームのサーバプログラム

int main()
{
	int soc;
	
	//接続受け取りまで
	if ((soc = setup_server(PORT)) == -1) //先に用意したライブラリ関数
		exit(1);
	
	// セッションモジュールの初期化
	session_init(soc, 'o', 1, 1, 'x', 10, 10);

	//セッションのループ
	session_loop();

}